[
   {
     "id":1,
     "title": "What is MuleSoft? and advantagess",
     "content": "Mulesoft is an integration platform to connect applications, data, and devices within the cloud and on-premises environments",
     "point1": "",
     "point2": "*Organizations always want their system to be in sync so that they can operate all together and because of which integration need comes into picture",
     "point3": "<strong>Challenges Before Mulesoft</strong><br>1. Complexity – if system A is connected with B, C and D and if there is a change in A system then all other system need a change",
     "point4": "2. Rigid Architecture – no space for change<br>3. Reliability – if one of the system fail then there is no reliable way of putting that system out of network and all communication with the system will be lost",
     "point5":"4. Tightly Coupled – each system is connected with all other system so change in one system need a change in many different system<br><strong>Advantages</strong><br>1. Remove Earlier complexities <br> 2. Increase customer engagement <br> 3. Improve Agality",
      "point6":"",
      "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/2017/07/spaghetti-code.png\" style=\"width: 40%;\"> <img src=\"https://eshiasolutions.com/wp-content/uploads/2021/08/What-is-MuleSoft-A-simplified-look.jpg\" style=\"width: 40%;\">"
   },
   {
     "id":2,
     "title": "What is Integration?",
     "content": "Act of bringing smaller components together in order to work as single product",
     "point1": "",
     "point2": "",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": ""
   },
   {
     "id":3,
     "title": "What is Middleware?",
     "content": "Where we can host our applications, Mulesoft is a platform/product for middleware needs with in an organization",
     "point1": "Organizations can have multiple applications to run day to day operations",
     "point2": "Organization always wants there system to be in sync so that they can operate all together and because of which integration comes into the picture",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": ""
   },
   {
     "id":4,
     "title": "What is API? (Application Program Interface)",
     "content": "Api is a way for two or more computer programs to communicate with each other. ",
     "point1": "Organizations can have multiple applications to run day to day operations",
     "point2": "Organization always wants there system to be in sync so that they can operate all together and because of which integration comes into the picture",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": ""
   },
   {
     "id":5,
     "title": "What is Mulesoft ESB? (Enterprise service bus)",
     "content": "1. Mule ESB is an middleware tool for integrating various applications together over a bus like architecture ",
     "point1": "2. Mule ESB (Enterprise Service Bus) is a software integration platform that helps connect different applications, systems, and services together.",
     "point2": "",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://www.mulesoft.com/sites/default/files/diagram-basic-esb.png\" style=\"width:40% !important\">"
   },
   {
     "id":6,
     "title": "What are business groups (BG)? (Max: 100 can be created)",
     "content": "Business groups used to manage anypoint resources including API's, applications.",
     "point1": "Each Business group has its own set of permissons and roles",
     "point2": "Organized in a hierarchial tree where the top level BG is root",
     "point3": "Each BG you create can have one direct parent and multiple children",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/2015/06/Anypoint_Platform.png\" style=\"width: 40%;\"><img src=\"https://www.caeliusconsulting.com/blogs/wp-content/uploads/2021/03/bg-Step-3.png\" style=\"width: 40%;\">"
   },
     {
     "id":7,
     "title": "What is Runtime Manager? ",
     "content": "With Runtime Manager, you can deploy, manage, and monitor your Mule applications in a sandbox, staging, or production environment from one central location, whether your apps are deployed in the cloud or on-premises.",
     "point1": "<strong>You can use Runtime Manager in these scenarios:</strong> <br> <strong>1. CloudHub:</strong> CloudHub is a complete integration platform as a service (iPaaS) that automatically meets all of your server needs without requiring any configuration or customization, including object store infrastructure, monitoring, troubleshooting, and scheduling. <br> ---->For applications deployed to CloudHub, you can use Insight for analytics and monitoring.",
     "point2": "<strong>3. Hybrid:</strong> Your on-premises Mule servers host your app deployments and you use the Anypoint Platform Runtime Manager cloud console to manage them.",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/rtm-overview.png\" style=\"width: 40%;\">"
   },
    {
     "id":8,
     "title": "Different Enviornment in Runtime Manager? (QA/Preprod)",
     "content": "If you have multiple environments in your organization, you can switch between them. From any application in Anypoint Platform, you can switch to a different environment.",
     "point1": "1. Click the current environment in the top left corner of Runtime Manager.",
     "point2": "2. Select the environment to which you want to switch",
     "point3": "3. Click Switch.",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/managing-deployed-applications-0e10f.png\" style=\"width: 40%;\">"
   },
    {
     "id":9,
     "title": "How to deploy mule apps?",
     "content": "You can deploy mule apps to cloudhub from Anypoing Runtime Manager, AnyPoint Studio, Cloudhub CLI",
     "point1": "<strong>Deploying Mule app through CLI</strong> <br> Enter your username: <mark>anypoint-cli --username=\"user\"</mark>",
     "point2": "<mark>runtime-mgr cloudhub-application deploy myMuleApp /Users/exported-app-folder/my-mule-app.zip<mark>",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/cloudhub-deploy-app.png\" style=\"width: 40%;\">"
   },
    {
     "id":10,
     "title": "What are servers, server Groups, and Clusters?",
     "content": "Both server groups and clusters run applications in multiple distributed nodes. When using a server group, instances of the applications are completely isolated from each other. In a cluster configuration, the nodes are aware of one another and share common information and synchronize statuses.",
     "point1": "1. After setting up a server, you can add it to a server group or cluster. ",
     "point2": "2. Then, select the server, group, or cluster as the deployment target for your applications.",
     "point3": "3. When using a server group, instances of the applications are completely isolated from each other. In a cluster configuration, the nodes are aware of one another and share common information and synchronize statuses.",
     "point4": "4. All servers in a server group or clusters must have the same Mule runtime engine version and Runtime Manager agent version.",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://blogs.perficient.com/files/2016/04/local-servers.jpg\">"
   },
    {
     "id":11,
     "title": "Different Alerts in Runtime Manager?",
     "content": "You can set up alerts to send email notifications when application or server events occur.",
     "point1": "<mark>Application Deployed / Application Failed</mark>",
     "point2": "<mark>CPU Usage / Memory Usage</mark> is equal or above 80% for atleast 10 Minutes",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id": 12,
     "title": "How to troubleshoot Applications?",
     "content": "You can access information to help you troubleshoot applications using the following tools:",
     "point1": "<strong>Insight:</strong>You can access a dashboard with key metrics and see events at an individual transaction level of detail.",
     "point2": "<strong>API Functional Monitoring:</strong>Using API functional monitoring, you can automate testing and generate reports to verify API functionality and validate the results that the API generates. You can monitor APIs at each stage of the software development life cycle and in production.",
     "point3": "<strong>View Application Log data:</strong>You can access a log of events occurring to your application and the CloudHub workers they run on. <br> For applications deployed to your own servers, you can export log data to third-party software to view there.",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id": 13,
     "title": "What is Cloudhub?",
     "content": "CloudHub is an <mark>&nbsp;integration platform as a service (iPaaS)&nbsp;</mark> iPaaS). <br> It enables you to deploy and run the application in the cloud via Runtime Manager.",
     "point1": "1. Cloudhub is Scalable, multi-tenant, elastic, secure, and highly available iPaas",
     "point2": "2. CloudHub is managed via the Runtime Manager console in the Anypoint platform",
     "point3": "3. It enables you to deploy Mule applications from Anypoint Studio using the CloudHub API or the CloudHub Command Line Interface.",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id":14,
     "title": "What is a Worker?",
     "content": "Applications on CloudHub are run by one or more instances of Mule, called workers. Below is a list of some characteristics.",
     "point1": "<strong>Charectaristics:</strong>",
     "point2": "<strong>1.Capacity:</strong> Each worker has a specific amount of capacity to process data. You can select the size of your workers when configuring an application. ",
     "point3": "<strong>2.Isolation:</strong> Each worker runs in a separate container from every other application.",
     "point4": "<strong>3.Manageability:</strong> Each worker is deployed and managed independently. ",
     "point5":"<strong>4.Locality:</strong> Each Worker runs in a specific worker cloud such as Asia Specific / US / EU ",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id":15,
     "title": "What is VCore?",
     "content": "A unit of compute capacity for processing on CloudHub, which is equal to one virtual core.",
     "point1": "<mark>1Vcore - 10 Apps</mark>",
     "point2": "0.1 Vcore - Can be consumed for 1 Mule Application",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img style=\"width: auto;\" src=\"https://blogs.mulesoft.com/wp-content/uploads/img_6059d59ace619.png\">"
   },
    {
     "id":16,
     "title": "What is Listener?",
     "content": "It enables to setup an http server and trigger flows when receiving http request.",
     "point1": "We can choose what methods that source accept such as GET and POST or a list of methods",
     "point2": "",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://dz2cdn1.dzone.com/storage/temp/2657609-picture2.png\">"
   },
    {
     "id":17,
     "title": "What is Logger?",
     "content": "This core component helps you to monitor and debug mule applications by logging important information such as error message, status notifications, payloads and so on.",
     "point1": "",
     "point2": "",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"https://docs.mulesoft.com/mule-runtime/4.4/_images/logger-flow.png\">"
   },
   {
    "id":18,
    "title": " What are Anypoint Connectors?",
    "content": "Anypoint Connectors can receive or send messages between Mule and one or more external sources, such as files, databases, or Web services.",
    "point1": "Connectors in Mule are either <strong>endpoint-based</strong> or <strong>operation-based</strong>",
    "point2": "<strong>Endpoint-Based Connectors :</strong> <br> Endpoint-based connectors are configured as either inbound or outbound endpoints in a flow. <br> ->Inbound endpoints serve as a message source for a flow. <br> -> Outbound endpoints can occur mid-flow or at the end of flows, and send information to external systems.",
    "point3": "<img src=\"https://docs.mulesoft.com/mule-runtime/3.9/_images/endpointbased.png\"  style=\"width: auto;\">",
    "point4": "<strong>Operation-Based Connectors :</strong> <br> When you add an operation-based connector to your flow, you immediately define a specific operation for that connector to perform.",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/mule-runtime/3.9/_images/operationbased.png\"  style=\"width: auto;\">"
  },
  {
    "id":19,
    "title": "What is API led Connectivity?",
    "content": "Its a methodological way to connect data through applications through Reusable API's, these API's are developed to play specific role. ",
    "point1": "1. Unlocking data from systems",
    "point2": "2. Composing data into processes or delivering an experience.",
    "point3": "<strong>API led connectivity falls into 3 categories</strong>",
    "point4": "--><strong>Experience API:</strong> These API's connect with clients it involves only the transformation of data.",
    "point5":"--><strong>Process API:</strong> These API's are used to implment common business logic and it should be reusable across the organizations.",
     "point6":"--><strong>System API:</strong> These API's are mainly used to access core systems/legacy systems and also we can modify with out touching expericne layer or process layer",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/2017/07/api-led-connectivity.png\" style=\"width: auto;\">"
  },
   {
     "id":20,
     "title": "What is Mulesoft cloudhub architecture? (Platform Services / Worker Cloud)",
     "content": "Cloudhub integrates two major components ",
     "point1": "1. Platform Sevices <br> 2. Worker Clould <br> These two components and run time manager work together to run mule application in the cloud",
     "point2": "<strong>Platform Services:</strong><br>Cloudhub shares a set of platform services including cloudhub services, alerting, logging, account management vpc, loadbalancer, vpn ",
     "point3": "<strong>Worker Cloud:</strong><br>It’s a cloud based elastic mule instance that runs integration applications. ",
     "point4": "We can use the console to monitor and manage the applications while it is running. ",
     "point5":"(start, stop, restart, delete) the application <br>Monitor & Troubleshooting <br> Updating the application  <br> Managing Logs, insights, notifications, worker monitoring ",
      "point6":"Managing servers, create clusters etc… ",
      "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/architecture-diagram.png\">"
   },
    {
     "id":21,
     "title": "What is Server?",
     "content": "Anypoint Runtime Manager provides an interface to manage your on-premises servers. You can manage servers either individually or in server groups or clusters.",
     "point1": "Servers communicate with Runtime Manager using Runtime Manager agent. After adding a server you deploy applications to the Mule instance. You can also view information about the environment where you installed Mule",
     "point2": "",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id":22,
     "title": "What is Clustering in Mulesoft?",
     "content": "A cluster is a set of up to eight servers that act as a single deployment target and high-availability processing unit. ",
     "point1": "Application instances in a cluster are aware of each other, share common information, and synchronize statuses.",
     "point2": "If one server fails, another server takes over processing applications. A cluster can run multiple applications.",
     "point3": "<strong>Benifits of Clustering:</strong><br> 1. Clustering helps in improving application performance by dividing the workload between nodes/servers in a cluster. ",
     "point4": "2. Horizontal scaling can be done wherever required (Increasing Workers) (means Increase count of servers). ",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
    {
     "id":23,
     "title": "Multicast vs Unicast Clusters",
     "content": "<strong>Unicast:</strong>A unicast cluster requires that you configure the IP addresses of the nodes in the cluster. (Default Port: 5071)",
     "point1": "If a server has multiple interfaces use the internal IP Address that allows the node to directly communicate with other nodes. ",
     "point2": "<strong>Multicast:</strong>A multicast cluster comprises servers that automatically detect each other. Servers that are part of a multicast cluster must be on the same network segment.",
     "point3": "",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
   {
    "id":24,
    "title": "Server Group Vs Cluster?",
    "content": "Both server groups and clusters run applications in multiple distributed nodes",
    "point1": "<strong>Server Group:</strong> Instances of the applications are completely isolated from each other.",
    "point2": "<strong>Cluster:</strong> Nodes are aware of each other and share common configuration and synchronize statuses.",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.ibb.co/MpHP47r/servergroup-vs-clusters.png\">"
  },
  {
    "id":25,
    "title": "What is TLS? (Transport Layer Security)",
    "content": "It is a widely adapted security protocol designed to facilitate privacy and data security for communication over the internet.",
    "point1": "Current Version: TLSv1.3",
    "point2": "Older Versions: (TLSv1.0, TLSv1.1, TLSv1.2)",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":26,
    "title": "What is Any Point Exchange in Mulesoft?",
    "content": "Anypoint Exchange provides the benefit of being able to discover, share, and incorporate assets and resources into your applications.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/exchange/_images/ex2-old-search-landing.png\"  style=\"width:60%;\">"
  },
  {
    "id":27,
    "title": "What is API Manager?",
    "content":"1. It's a component of AnyPoint Platform for Managing API's",
    "point1": "2. Used to Apply Security Policies on API's",
    "point2": "3. Manage Client Access",
    "point3": "4. Gain critical insights into your API reliability, performance, and compliance",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://www.mulesoft.com/sites/default/files/2022-02/MS_APIManager_Feature_1.svgz\">"
  },
  {
    "id":28,
    "title": "What is Api AUTO Discovery?",
    "content": "1. Api auto discovery is used to pair the API in api manager to a deployed mule application",
    "point1": "2. When auto discovery is correctly configured in mule app we can say that our mule app api is tracked or paired to api manager",
    "point2": "<a href=\"https://apisero.com/api-auto-discovery-for-mule-4-application\" target=\"_blank\">AUTO DISCOVERY SETUP</a>",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":29,
    "title": "What is Design Center?",
    "content": "We can design and build API's and integrations using <strong>OAS(Open API specifications)/RAML(Restful API Modeling Language)</strong>",
    "point1": "1. Design APIs rapidly <br> <img src=\"https://www.mulesoft.com/sites/default/files/2018-07/MS_AnypointPlatform_DesignerCenter_Benefit.png\">",
    "point2": "2. Connect to any system <br>",
    "point3": "3. Map Data in Real time",
    "point4": "4.Test and Deploy Applications",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":30,
    "title": "Rest Vs SOAP Api's",
    "content": "Rest is Better choice for simple CRUD oriented services <br><strong>REST:</strong> Represents Http Methods (GET, POST, PUT, DELETE)",
    "point1": "1. Easier to use and light weight",
    "point2": "2. Human Readable and easy to understand <br> 3. Invokes services using URL ",
    "point3": "<strong>SOAP:</strong> Simple Object Access Protocol",
    "point4": "1. Doesn't support error handling",
    "point5":"2. Difficult to Read",
     "point6":"3. Invokes calls by using RPC Method.",
     "image": "<img src=\"https://www.sepaforcorporates.com/wp-content/uploads/2018/05/rest-api-versus-soap-api-2.jpg\">"
  },
  {
    "id":31,
    "title": "What are API Manager Alerts?",
    "content": "1. Request Count <br> 2. Response Code <br> 3. Policy Violation <br> 4. Response Time",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":32,
    "title": "What are HTTP Methods? (Post/GEt/Put/Delete)), Whare are Status Codes?",
    "content": "Post -> Create <br> GET (Read) <br> PUT (Update) <br> Delete (Delete)",
    "point1": "<strong>Status Codes (100-599)</strong>",
    "point2": "1xx - Information Response",
    "point3": "2xx - Success",
    "point4": "3xx - Redirection",
    "point5": "4xx - client errors",
     "point6": "5xx - server errors",
     "image": "<img src=\"\">"
  },
  {
    "id":33,
    "title": "What are Security Policies used by Admin?",
    "content": "These are used under API Manager for security like",
    "point1": "1. Oauth Access Token enforcement <br> 2. JWT Validation (Json Web Token) -> All calls to use the API must include JWT",
    "point2": "3. IP Block List (Denies service calls) <br> 4. IP Allow list (Allows service calls)",
    "point3": "5. Rate Limiting (specifies maximum value for the number of messages that are processed) <br> 6. Spike Control (Controls spikes in traffice by limiting the number)",
    "point4": "7. Client ID Enforcement (Calls to API must include client id and client secret) <br> 8. Cross-Origin Resource sharing (Mechanism that allows javascript)",
    "point5":"9. Message logging (logs custom messages beteween policies and flows)",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":34,
    "title": "What is Thread Dump and Heap Dump?",
    "content": "Sometimes Mule stops working, No error messages, no exceptions in logs, something in depth mule freezes, so we need more information as possible from thread dumps, heap dumps",
    "point1": "<strong>Thread Dump:</strong> is used to diagnose CPU Spikes, deadlocks, poor response times, memory problems, unresponsive applications",
    "point2": "<strong>Heap Dump:</strong>is used to detect memory leaks.",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":35,
    "title": "What is Autoscaling in cloud hub?",
    "content": "You can define policies that respond to CPU or memory usage thresholds by scaling up or scaling down the processing resources used by an application",
    "point1": "To use autoscaling feature org/business group must have a ela(enterprise license agreement)",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/autoscale-create-policy.png\"><img src=\"https://docs.mulesoft.com/runtime-manager/_images/policy-form.png\">"
  },
  {
    "id":36,
    "title": "What is Static IP?",
    "content": "To enable a static IP for your application, go to the Static IPs tab in the application settings page on the Runtime Manager UI, then enable the Use Static IP checkbox:",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://help.mulesoft.com/servlet/rtaImage?eid=ka42T000000PG1W&feoid=00N34000005C99j&refid=0EM2T000001Kel6\">"
  },
  {
    "id":37,
    "title": "What is Analytics? ",
    "content": "it is used to analyze how API's are performing, from API manager we can access analytics dashboard",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":38,
    "title": "What is Anypoint Monitoring?",
    "content": "We can see overview of application like Average response time, erors, cpu utilization, heap used, jvm thread count and performance",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":39,
    "title": "What is Anypoint VPC? (Virtual Private Cloud)",
    "content": "It allows you to create logical or isolated networks in the cloud where you can deploy or run the resources securely.",
    "point1": "1. Anypoint VPC allows you to extend your corporate network and allows cloudhub workers to connect resources behind the firewalls.",
    "point2": "2. We can connect on prem data centers through a secured vpn tunnel.",
    "point3": "<strong>Charectaristics</strong>",
    "point4": "&#8658;Multiple VPC can be created in same region (Prod / NonProd).",
    "point5":"&#8658;Multiple environments can be mapped to same VPC.",
     "point6":"&#8658;Always create the VPC in the parent business group and share with sub business groups. <br> <strong> Advantages</strong> <br> 1. Create secure virtual network with in cloudhub <br>  2. Connect cloudhub assets behind the firewall <br> 3. Deploy Mule Runtime Securely <br> 4. Connect cloudhub to any public cloud or onprem datacenter securely.",
     "image": "<img src=\"https://i.ibb.co/wN3VFvb/vpc.jpg\">"
  },
  {
    "id":40,
    "title": "CIDR (classless inter domain routing) VPC Sizing? (192.168.0.0/block size)",
    "content": "1. Its the way of allocating IP Addresses and IP routing in more efficient manner",
    "point1": "2. This method allocates IP Address/host in most efficient way and avoids wastage of IP Address.",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/img_6059d4ec49af6.png\">"
  },
  {
    "id":41,
    "title": "What is Load Balancer and Types? DLB and SLB",
    "content": "If a single server goes down, load balancer automtically redirects traffic to available servers, if we add a new server to the server group it automatically starts to send requests to it.",
    "point1": "Cloud Hub Provides two types of load balancers <br> 1. Sharead Load Balancer <br> 2. Dedicated Load Balancer",
    "point2": "<strong>Shared Load Balancer</strong> <br> -> 1. Cloudhub provides default shared load balancer available for all environments <br> -> 2. Shared load balancers don’t allow you to configure custom SSL certificates or proxy rules. <br> -> 3. Additionally, shared load balancers have lower rate limits that help ensure platform stability depends on the region",
    "point3": "<strong>Dedicated Load Balancer</strong><br> -> 1. Handle Load Balancing among the different cloudhub workers that run your application <br> -> 2. We can configure custom SSL configurations and also we can enforce two way authentication <br> -> 3. We can confure proxy rules that map apps to custom domains, this enables to host applications under a single domain",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/pasted-image-0-17-1024x573.png\" style=\"width:60%;\">"
  },
  {
    "id":42,
    "title": "What is Anypoint VPN / VPN Routing? Static Routing VS Dynamic Routing?",
    "content": "used to create secure connection between  cloudhub and on premises datacenters",
    "point1": "",
    "point2": "VPN Routing Types",
    "point3": "",
    "point4": "<strong>1. Static Routing </strong> <br> 1. Requires you to specify the routes in your network that are accessible through Anypoint VPN <br> 2. Ideal for Small Networks",
    "point5":"<strong>2. Dynamic Routing</strong> <br> 1. It adjusts the routes automatically <br> 2. Ideal for Large Networks",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/img_6059c0e201c72.png\" style=\"width:60%;\">"
  },
  {
    "id":43,
    "title": "What is Apache Jmeter?",
    "content": "It is used for Performance and load testing",
    "point1": " <strong>Features</strong>",
    "point2": "1. Opensource",
    "point3": "2. User Friendly - Simple and Interactive GUI",
    "point4": "3. Platform Independent",
    "point5":"4. Support Different server types like Web based Http / Https",
     "point6":"<strong> Steps for Testing in Apache Jmeter 5.5</strong><br> -> bin > jmeter.jar (open it) <br> -> Select Test Plan -> Right Click -> Add -> Threads -> Thread Group <br> -> Right click on thread group -> add -> Sampler -> http request <br> --> Select Test Plan -> Right Click on Threads -> add -> listener -> sample tree <br> -> Right click on thread group -> add -> Listener -> View Results Tree <br> ->Right click on thread group -> add -> listener -> summary report ",
     "image": "<img src=\"https://i.ibb.co/sQ5bvSB/jmeter.png\">"
  },
  {
    "id":44,
    "title": "What are Cloudhub Logs?",
    "content": "Log Contains information about app and lifecycle events.",
    "point1": "1. Deployment Log <br> 2. System Log",
    "point2": "3. Worker Log  -> Logs, Diagnostics, Mule Logs",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.ibb.co/4VknFFk/cloudhub-logs.png\" style=\"width:20%\">"
  },
  {
    "id":45,
    "title": "What are Onpremises Logs?",
    "content": "Log Contains information about app and lifecycle events.",
    "point1": "1. mule_agent.log",
    "point2": "2. mule_ee.log",
    "point3": "3. appname.log",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":46,
    "title": "What are OnPremises alerts?",
    "content": "Application Undeployed",
    "point1": "Deployment Success",
    "point2": "Deployment Failed ",
    "point3": "Number of Errors",
    "point4": "Number of Mule Messages",
    "point5":"Response Time",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id":47,
    "title": "What are Cloudhub alerts?",
    "content": "CPU Usage / Memory Usage",
    "point1": "Deployment Success / Deployment Fail",
    "point2": "Worker Not Responding",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
   {
     "id":48,
     "title": "What is a scheduler in Mulesoft?",
     "content": "The Scheduler component enables you to trigger a flow when a time-based condition is met.",
     "point1": "You can configure it to be triggered at a regular interval or give it a more flexible cron expression. ",
     "point2": "<strong>1. Fixed Frequency:</strong>You can use the following parameters to set a Scheduler to trigger a flow at a regular intervals. Options(Frequency: 1000, Start Delay: 0, Time Unit: Milliseconds)",
     "point3": "<strong>2. Cron Expression:</strong>Cron is a widely used standard for describing time and date information.",
     "point4": "",
     "point5":"",
      "point6":"",
      "image": "<img src=\"\">"
   },
   {
    "id":49,
    "title": "What is Cloudhub Architecture?",
    "content": "",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\">"
  },
  {
    "id": 50,
    "title": "What are VPC Firewall Rules?",
    "content": "When you create an Anypoint Virtual Private Cloud (Anypoint VPC), you can add your own firewall rules to allow specific IP ranges and ports to reach your workers.",
    "point1": "You can configure approximately 35 firewall rules per VPC",
    "point2": "connections from anywhere through ports 8081 and 8082",
    "point3": "Anypoint VPC through ports 8091 and 8092",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/runtime-manager/_images/firewall-rules-page.png\">"
  },
  {
    "id":51,
    "title": "What is Access Management?",
    "content": " The Anypoint Platform allows you to create and manage separate environments for deploying, which are independent from each other.",
    "point1": "1. Sandbox for Dev and QA Testing",
    "point2": "2. Prod for Live App",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 40%;\"> "
  },
  {
    "id":52,
    "title": "View Organization / View Business Groups?",
    "content": "Business groups are self-contained resource groups that contain Anypoint Platform resources such as applications and APIs. ",
    "point1": "--> Business groups reside within the root organization and are organized in a hierarchical tree where the top-level business group is the root.",
    "point2": "--> Each business group you create has one direct parent and can have multiple children.",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://help.mulesoft.com/servlet/rtaImage?eid=ka42T000000TX1M&feoid=00N34000005C99j&refid=0EM2T000000a9tb\" style=\"width: 40%;\"> <img src=\"https://blogs.mulesoft.com/wp-content/uploads/2015/06/Anypoint_Platform1.png\" style=\"width: 40%;\">"
  },
  {
    "id":53,
    "title": "How to Create Business Group?",
    "content": "",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://www.caeliusconsulting.com/blogs/wp-content/uploads/2021/03/bg-Step-3.png\" style=\"width: 40%;\"> "
  },
  {
    "id":54,
    "title": "Users?",
    "content": "As an organization administrator of a root organization, you can invite new users and manage existing users for your organization.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.ibb.co/q1gpTbH/users.png\" style=\"width: 60%;\"> "
  },
  {
    "id":55,
    "title": "Roles?",
    "content": "A role is a set of predefined permissions controlling access to each product or feature within Anypoint Platform.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.ibb.co/VVpkf2W/roles.png\" style=\"width: 100%;\"> "
  },
  {
    "id":56,
    "title": "Environments?",
    "content": "Anypoint Platform enables you to create and manage separate deployment environments for APIs and applications. ",
    "point1": "These environments are independent from each other.",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.ibb.co/5KvT4x8/environments.png\" style=\"width: 80%;\"> "
  },
  {
    "id":57,
    "title": "Identity Providers?",
    "content": "Used to configure identity management in Anypoint Platform to set up users for single sign-on (SSO)",
    "point1": "An organization can have up to 25 external identity providers, or IdPs, configured for SSO.",
    "point2": "<strong>OpenID Connect:</strong> End user identity verification by an authorization server including SSO",
    "point3": "<strong>SAML 2.0: (Salesforce/PingFederate (versions: 6, 7, 8), Okta)</strong>",
    "point4": "Web-based authorization including cross-domain SSO",
    "point5":"",
     "point6":"<a href=\"https://dzone.com/articles/setup-mulesoft-anypoint-platform-identity-using-ok#:~:text=MuleSoft%20Anypoint%20Platform%20supports%20external,an%20authorization%20server%20including%20SSO\" target=\"_blank\">How To Setup</a>",
     "image": "<img src=\"https://dz2cdn1.dzone.com/storage/temp/12915610-oauth8.png\" style=\"width: 80%;\"> "
  },
  {
    "id":58,
    "title": "Client Providers?",
    "content": "Anypoint Platform acts as a client provider by default, but you can also configure external client providers to authorize client applications. ",
    "point1": "As an API owner, you can apply an OAuth 2.0 policy to authorize client applications that try to access your API. You need an OAuth 2.0 provider to use an OAuth 2.0 policy.",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://help.mulesoft.com/servlet/rtaImage?eid=ka42T000000bro5&feoid=00N34000005C99j&refid=0EM2T000000aQ4B\" style=\"width: 60%;\"> "
  },
  {
    "id":59,
    "title": "Audit log?",
    "content": "Changes made by users within Anypoint Platform organizations are logged through an audit logging service. You can access the data logs through the audit logging query API or through the audit logging UI.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 40%;\"> "
  },
  {
    "id":60,
    "title": "Trusted Domains?",
    "content": "Manage domains that are allowed in the organization to make HTTP requests through Anypoint proxy. These domains are your API domains hosted in other than anypoint.com domain",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":61,
    "title": "Runtime Manager Settings in Access Management?",
    "content": "We can change the region of apps deployment",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":62,
    "title": "Subscription?",
    "content": "We can see our account subscription information like (Org Name, Subscription Tier, Expiration Date)",
    "point1": "1. Vcore Sizes of different environments like (Prodution, Sandbox, Design)",
    "point2": "2. Number of Static IPs",
    "point3": "3. VPC Count",
    "point4": "4. Load Balancers Count",
    "point5":"5. Network Connections",
     "point6":"",
     "image": "<img src=\"https://help.mulesoft.com/servlet/rtaImage?eid=ka42T000000fz3P&feoid=00N34000005C99j&refid=0EM340000007I1Q\" style=\"width: 60%;\"> "
  },
  {
    "id":63,
    "title": "What is API Manager?",
    "content": "API Manager is a component of Anypoint Platform that enables you to manage, govern, and secure APIs.",
    "point1": "API Manager manages APIs that reside in Exchange",
    "point2": "API Manger is used to apply the policies on APIs",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.postimg.cc/TYyYJ01C/apimanager.png\" style=\"width: 80%;\"> "
  },
  {
    "id":64,
    "title": "What is API Autodiscovery?",
    "content": "API Autodiscovery is used to pair the API in API Manger to deployed mule application",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":65,
    "title": "What are API Groups?",
    "content": "An API group is an API asset that enables organizations to publish a group of API instances / ID as a single unit.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":66,
    "title": "What are Automated Policies?",
    "content": "Policy automation enables security architects and administrators to secure and govern every API running in an environment.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":67,
    "title": "What are Client Applications?",
    "content": "Applications are external services that consume APIs. For details about applications and their related contracts",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":68,
    "title": "What are Custom Policies?",
    "content": "Custom policies are policies that anyone can develop and apply to their APIs, with the intention of extending existing functionality or defining new functionality. ",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":69,
    "title": "What are Analytics?",
    "content": "API analytics provide insight into how your APIs are being used and how they are performing.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id": 70,
    "title": "Type of Alerts in API Manager?",
    "content": "<strong>Severity:</strong> 1. Info, 2. Warning 3. Critical",
    "point1": "<strong>Info, Warning, Critical:</strong> 1. Request Count 2. Response Code 3. Policy Violation, Response Time.",
    "point2": "Add Receipients and create alert.",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":71,
    "title": "Policies in API Manager?",
    "content": "Policies enable you to enforce regulations to help manage security, control traffic, and improve adaptability of your APIs",
    "point1": "<strong>Security:</strong> 1. Oauth 2.0, 2. JWT (Json Web Token), 3: IP Allowlist, 4: IP Blocklist",
    "point2": "<strong>Quality of Service:</strong> 1. Rate Limiting (SLA Based): Specifies Max value for the number of messages processed. 2. Spike Control",
    "point3": "<strong></strong>",
    "point4": "<strong></strong>",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":72,
    "title": "SLA Tiers / Limits?",
    "content": "Service Level Access (SLA): Determines whether access to the api at a certian level requieres your approval.",
    "point1": "<strong>Rate Limiting</strong>: Enables us to control incoming traffic to an API by limiting the number of requests.",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"\" style=\"width: 60%;\"> "
  },
  {
    "id":73,
    "title": "What is Anypoint VPC Peering?",
    "content": "VPC peering basically connects two VPCs. In this case, it pairs your private Amazon VPC directly to your Anypoint VPC. ",
    "point1": "This enables you to route traffic between the two VPCs so they can communicate as though they are in the same network.",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://docs.mulesoft.com/cloudhub-1/_images/vpc-overview-peering.png\" style=\"width: 60%;\"> "
  },
  {
    "id":74,
    "title": "What is API Governance?",
    "content": "Anypoint API Governance ensures consistent and improved API quality and security",
    "point1": "API design with anypoint best practices",
    "point2": "You can monitor your APIs' conformance and notify developers to help improve the conformance.",
    "point3": "Apply consistent rules from design time to deployment",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://i.postimg.cc/hGZmxhWZ/api-governance.png\" style=\"width: 80%;\"> "
  },
  {
    "id":75,
    "title": "What is Anypoint Monitoring?",
    "content": "Anypoint Monitoring provides unparalleled visibility, which helps us proactively identify issues and reduce mean time to resolution.",
    "point1": "",
    "point2": "",
    "point3": "",
    "point4": "",
    "point5":"",
     "point6":"",
     "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/anypoint-monitoring-1.png\" style=\"width: 80%;\"> "
  },
  {
      "id":76,
      "title": "What is Functional Monitoring?",
      "content": "API Functional Monitoring enables you to monitor responses to requests sent to API resources at their endpoints",
      "point1": "",
      "point2": "",
      "point3": "",
      "point4": "",
      "point5":"",
       "point6":"",
       "image": "<img src=\"\" style=\"width: 60%;\"> "
    },
    {
      "id":77,
      "title": "What is Performance Monitoring?",
      "content": "Graphical representation of AP Response Time, Failures",
      "point1": "",
      "point2": "",
      "point3": "",
      "point4": "",
      "point5":"",
       "point6":"",
       "image": "<img src=\"https://blogs.mulesoft.com/wp-content/uploads/anypoint-monitoring-2.png\" style=\"width: 60%;\"> "
    },
       
    {
         "id":78,
         "title": "What is Anypoint Visualizer?",
         "content": "Anypoint Visualizer provides a real-time, graphical representation of the APIs, and Mule applications that are running and discoverable",
         "point1": "Anypoint Visualizer collects data from Mule applications, APIs, and proxies deployed to CloudHub",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"https://docs.mulesoft.com/visualizer/_images/application-network.png\" style=\"width: 80%;\"> "
       },
       {
         "id": 79,
         "title": "Challenging task",
         "content": "Earlier we were using Legacy VPN and we migrated it to Anypoint VPN",
         "point1": "Legacy VPN\n----------------\nstruggle with scalability as they often require additional hardware or significant manual intervention to scale up\nPerformance can be a limitation if the hardware is not regularly updated\nrequire ongoing management and monitoring, which can often be complex and require dedicated resources, especially in larger setups",
         "point2": "Anypoint VPN\n-----------------\nAnypoint VPN provides enhanced flexibility\nEach VPN connection consists of two tunnels for redundancy, ensuring high availability and reliability\nproviding a centralized way to monitor and manage all connections",
         "point3": "",
         "point4": "Checklist to Create Anypoint VPN\n---------------------\nRuntime Manager -> VPNs\nVPC Name, Select VPC, BGP (broader gateway protocol)",
         "point5": "Steps: we need to create new anypont vpn, confi remot ip address, ",
         "point6": "select the vpn we need to migrate",
         "image": ""
       },
       {
         "id":80,
         "title": "What is Mulesoft Runtime Fabric (RTF)?",
         "content": "Runtime Fabric is also a one of the deployment options when using anypoint runtime manager  ",
         "point1": "<strong>Differ:</strong> In CloudHub, MuleSoft maintains the runtime plane, whereas in on-premises and RTF deployments, the customer controls the runtime plane",
         "point2": "<strong>key components :</strong>The key components include the control plane, runtime plane, and the underlying infrastructure (which could be on-premises or cloud-based) ",
         "point3": "<strong>architecture </strong>:Mulesoft RTF architecture includes a control plane managed by MuleSoft and a runtime plane managed by the customer. The runtime plane consists of multiple worker nodes that run Mule applications and API gateways, combined by Kubernetes",
         "point4": "<strong> benefits :</strong>Benefits include improved scalability, automated orchestration, better resource utilization, and the ability to deploy across hybrid environments.",
         "point5":"<strong>deployed on RTF is not performing as expected?</strong>Steps include checking the application logs, monitoring resource usage, verifying network connectivity, and ensuring that the application configuration is correct. Additionally, using RTF's built-in monitoring tools to identify bottlenecks and performance issues.",
          "point6":"<strong>ensure high availability and fault tolerance in RTF?</strong>High availability and fault tolerance are ensured by deploying multiple worker nodes, using Kubernetes for orchestration, and configuring load balancing and failover mechanisms.",
          "image": "<img src=\"https://www.salesforce.com/blog/wp-content/uploads/sites/2/2023/05/img_6059d598a2eaf.png?strip=all&quality=95\" style=\"width: 60%;\"> "
       },
       {
         "id":81,
         "title": "RTF Cert Renewal Process?",
         "content": "we need to get cert files in JKS/PEM format, if we get it in other formate we need to move them to server and give full executable permissions CHMOD 777 filename",
         "point1": "then we need to convert it into .cert file using -> openssl pkcs12 -in dev-api-int.kci1.com-2023.pfx -out dev-api-int.kci1.com-2023.crt -nodes",
         "point2": "Converting as JKS file format with help of below command:->keytool -importkeystore -srckeystore test-api-int.kci1.com-2023.pfx -srcstoretype pkcs12 -destkeystore test-api-int.kci1.com.jks -deststoretype JKS",
         "point3": "goto Anypoint platform -> Runtime Fabrics -> Goto Inbound Traffic -> upload jks and give password",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":82,
         "title": "RTF Commands, RTF Troubleshooting? OPS Center (Worker nodes, controller nodes)",
         "content": "<strong>cmd:</strong> sudo gravity status(It will display the status of the cluster its active or not, healthy and online)",
         "point1": "<strong>cmd:</strong> sudo gravity plan (to check last update status)",
         "point2": "<strong>logs path:</strong> cat /var/log/rtf-init.log or cat /var/log/gravity-install.log",
         "point3": "<strong>cmd:</strong> sudo gravity enter (for accessing gravity container)",
         "point4": "<strong>check cluster health: cmd:</strong> etcdctl cluster-health",
         "point5":"<strong>journal:</strong> journalctl -p err -r (cmd for read and filter system log messages)",
          "point6":"<strong>check nodes:</strong> kubectl get nodes (this command provides overview of the nodes present in kubernetes cluster <br /> <strong>cmd:</strong> sudo kubectl get pods -o wide --all-namespaces (to list all pods in namespaces) <br /> <strong>cmd:</strong> sudo kubectl get events -all-namespaces (list out events for all the namespaces in the cluster <br/> <strong>cmd:</strong> kubectl delete pods -n {app_namespace} {app_pod} ",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id": 83,
         "title": "Handling High Availability, Performance optimization",
         "content": "Cloudhub: Multi-Worker Deployment, Global Load Balancing, Auto-Scaling",
         "point1": "RTF: Clustered Deployment, High Availability Configuration, Monitoring and Alerts",
         "point2": "Cloudhub: Efficient Use of vCores, Memory Management(avoid storing large payloads), Scheduler Configuration(config it only to run on primary node)",
         "point3": "RTF: Resource Allocation(on needs), Container Optimization",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":84,
         "title": "What is object store V2?",
         "content": "Object Store v2 lets Cloudhub applications store data and states across batch processes, Mule components and applications, from within an application.",
         "point1": "",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\">"
       },
       {
         "id":85,
         "title": "Best Practices for Building Secure APIs with MuleSoft",
         "content": "Use a Secure Communication Protocol: https",
         "point1": "Authenticate and Authorize API Requests: Policies like Basic Authentication, OAuth 2.0, and SAML",
         "point2": "Implement Rate Limiting and Throttling: can prevent malicious users or applications from overwhelming your API with requests, which can lead to denial of service (DoS) attacks",
         "point3": "Encrypt Sensitive Data at Rest",
         "point4": "Implement Logging and Monitoring",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":86,
         "title": "diff between cpu limit and reserved cpu",
         "content": "<strong>Reserved CPU:</strong> the amount of vcpu that is guaranteed for the applications use",
         "point1": "<strong>vcpu limit:</strong> Maximum amount of cpu an application can use",
         "point2": "Example: if api needs 3vcpus to handle sudden increase in traffic, it can use upto 4 as we assigned 4, if it requires 5vpcu it cant because its limit is given to 4",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":87,
         "title": "Disaster recovery (Multi Region deployments) High Availability Means? RTO / RPO",
         "content": "yes we do have DR activites planned every 6 months",
         "point1": "we do regualry backup of critical applications, databases and files, infra config (like network, security)",
         "point2": "<strong>Disaster Recovery:  Cold Standby:</strong>  Deploying apis in secondary region, this starts only when outage is detected application needs to be manually deployed in case of failure <br> <strong>Hot standby Active/Passive:</strong> APis fully deployed in sec region, capability to receive traffic any time only work when disaster revoery starts, this model doesn't allow smoke testing <br> <strong>Hot Standby (Active/Passive)</strong> Flexible but cost more, allows smoke testing, traffic can allow any time, both regions full functional, need global load balancers with multiple vpcs,   <br>  <strong> Cloudhub Availability: </strong>Cloudhub uses amazon aws for its cloud infra, losing a single zone may cuase performance degradation but the service will be availalbe",
         "point3": "<strong>RTO (Recovery time objective):</strong> is 72 Hrs is the time to recover one availability zone.",
         "point4": "<strong>RPO (Recovery point objective) </strong>: is 24hrs",
         "point5":"",
          "point6":"",
          "image": "<img src=\"https://i.ibb.co/jvY2fkT/mulesoftdr.png\" style=\"width: 60%;\"> <br> <img src=\"https://i.ibb.co/WDM9kPg/highavaialbilty.jpg\" style=\"width: 60%;\">"
       },
       {
         "id":88,
         "title": "Daily activities?",
         "content": "my daily activities are  checking the status of mulesoft applications",
         "point1": "Error handling: investigate and resolve errors or inform to the dev team if any issues",
         "point2": "Deploying new applications or updates and patches to various environments like (dev, sit, uat, prod)",
         "point3": "Ensure security policies are applied and access controls or in place like (user authentication)",
         "point4": "performance tuning like optimizing applications for memory usage and resource allocation",
         "point5": "verify backupps are complete and readily available for recovery",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":89,
         "title": "Why splunk is used?",
         "content": "this is an external logging tool, we are using it for log management, creating alerts/reports, creating dashboards",
         "point1": "",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":90,
         "title": "How to setup muleonpremise server",
         "content": "1. we need to download mule zip file",
         "point1": "2. configure the mule_home path to -> /opt/mule",
         "point2": "3. we need to modify wrapper.conf file for diff settings and ports needed",
         "point3": "4. for server logs we can check in mule_ee.log",
         "point4": "5. for every individual application we do have log file",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id": 91,
         "title": "what is secret manager and its uses?",
         "content": "we do use secret manager to store private keys, passwords, certificates, tls context",
         "point1": "also we can configure keystore, truststore and certificates",
         "point2": "its the secure and centralized way to manage sensitive information",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":92,
         "title": "Define VPC, VPN, INgress",
         "content": "vpc provides a virtual network for deploying mule applications",
         "point1": "vpn provides secure access to a vpc or on-premise network",
         "point2": "Ingress refers to the configuration settings that manage how incoming HTTP or HTTPS requests are routed to applications deployed in a private space",
         "point3": "Ingress settings are applied when deploying an application to a private space in Runtime Fabric or CloudHub 2.0.",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"https://docs.mulesoft.com/runtime-fabric/latest/_images/rtf-ingress-endpoint.png\" style=\"width: 60%;\"> "
       },
       {
         "id":93,
         "title": "define flex gateway",
         "content": "flex gateway enables us to manage and secure apis across multiple environments",
         "point1": "example: if a customer places an order through the app",
         "point2": "this request routes through the flex gateway which acts as an entry point",
         "point3": "it authenticates using oauth 2.0 that customer authorized to access the api",
         "point4": "it provides, authentication and authorization, real time analysis and insights, scalability and high availability",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":94,
         "title": "how can we securely create and manage api?",
         "content": "we can use api manager, implement security measures, oauth 2.0, basic authentication",
         "point1": "use api analytics to monitor api peroformance, usage and security",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":95,
         "title": "what is bash script",
         "content": "for automation or repetitive tasks we use it",
         "point1": "like parsing logs, transforming data ",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":96,
         "title": "what is ci cd pipeline",
         "content": "contious integratoin continous deployment, its a series of automated process to deploy api in different envioronments",
         "point1": "we are using bitbucket for pipeline configurations",
         "point2": "benefits: automated build, we can have control on environments for deployment",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":97,
         "title": "what are the policies configured for apis",
         "content": "for authentication: we use oauth 2.0,jwt,basic auth",
         "point1": "rate limiting, ip whitelisting, api versioning",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":98,
         "title": "how and why will have proxy applications",
         "content": "yes, by using proxy applications we can improve security and scalability, it acts as a intermediary between a client and backend service",
         "point1": "for loadbalancing (it distributes incoming traffic across backend services ensuring scalability and reliability) we use, caching etc...",
         "point2": "we do have some built in like http proxy (enables proxying http requests, api gateway)",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":99,
         "title": "onprem cert renewal?",
         "content": "we can renew from runtime manager (available from 2.8.4 runtime manager version), we can see the cert expiry date",
         "point1": "Steps: click on servers/clusters tab -> select server name -> click on actions dropdown -> click on renew certificate",
         "point2": "<strong>Renew Certificate from command line:</strong>",
         "point3": "1. Download the agent-certificate-renewer-{version}.jar -> move the jar file to bin -> need to stop the mule",
         "point4": "2. create a backup of conf folder ",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":100,
         "title": "onprem license renewal?",
         "content": "we need to follow few steps before license renewal ",
         "point1": "1) navigate to $MULE_HOME/conf",
         "point2": "2) delete the existing muleLicenseKey.lic file",
         "point3": "3) make sure the server is stopped",
         "point4": "4) use the following command <i>mule -installLicense ~/license.lic</i>",
         "point5":"5) start the mule server again",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":101,
         "title": "cloudhub or load balancer cert renewal?",
         "content": "Obtain SSL Certificate, ensure to have both cert and private key. convert the cert and key to pem format",
         "point1": "click on loadbalancers from menu -> in certificates tab -> click on add certificate",
         "point2": "we need to upload public key Ex: example-com-crt.pem(includes both the server certificate and the intermediate CA certificate) and private key( contains a passphrase-less private key) files",
         "point3": "ex: example-com-private-noencrypt.pem",
         "point4": "<strong>command:</strong>openssl rsa -in example-com-private.pem -out example-com-private_noencrypt.pem",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":102,
         "title": "what is mule runtime?",
         "content": "Mule Runtime is the engine that powers Mule applications, providing the necessary infrastructure for running, managing, and deploying integrations and APIs.",
         "point1": "",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":103,
         "title": "Difference between cloudhub 1.0 and 2.0?",
         "content": "as part of infrastructure 1. CloudHub 1.0 VPC peering and direct connect have been deprecated in CloudHub 2.0",
         "point1": "Further, when you delete a private space that has a transit gateway attached, the transit gateway is preserved, and you can reattach it to a different private space.",
         "point2": "Unlike VPCs in CloudHub 1.0, you can associate a private space with multiple environments ",
         "point3": "HTTP and HTTPS traffic uses port 8081",
         "point4": "More granular vCore allocation options you can now have the option to assign 0.5, 1.5, 2.5, 3.5 and 4 vCores",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":104,
         "title": "Why we use Mule Maven Plugin?",
         "content": "The Mule Maven plugin allows you to integrate the packaging and deployment of your Mule applications.",
         "point1": "By using mule maven plugin you can automate the deployment of mule application on Cloudhub, on-premise or on RTF",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":105,
         "title": "Best practices",
         "content": "Monitoring and Logging: Implement monitoring tools like Splunk",
         "point1": "Automation: Automate deployments, backups, and scaling using tools like Jenkins or Anypoint Platform's CI/CD",
         "point2": "High Availability: Design for high availability using load balancers, clustering, and auto-scaling.",
         "point3": "Security: Implement security measures like encryption, authentication, and authorization.",
         "point4": "Scalability: Design scalable architectures to handle increased traffic and demand.",
         "point5":"Backup and Recovery: Regularly backup data and implement disaster recovery processes.",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":106,
         "title": " Horizontal scaling vs vertical scaling",
         "content": "<strong>Vertical Scalability</strong> is nothing but increasing you vCore Size -> whenever we see app receives less number of requests as input for each request or process",
         "point1": "<strong>Horizontal Scalability</strong> is nothing but increasing your workers. -> whenever we see app receives more requests but less payload then go ahead increasing workers",
         "point2": "",
         "point3": "",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":107,
         "title": "Creating configuring and managing api gateway",
         "content": "An API gateway is an intermediary between a client application and a set of backend APIs, The gateway leverages the governance capabilities of API Manager, so that you can apply throttling, security, and other policies to your APIs",
         "point1": "<strong>Gateway installation: </strong> 1. From Studio ->2. On premises -> 3. in cloud",
         "point2": "<strong>Managing: </strong> Enable auto discovery (for tracking the api, enforcing policies, sending analytics), provide org details",
         "point3": "<strong>Configuring in onprem</strong>Updtate wrapper.conf file with org client id and client secret, <strong>Example:</strong> wrapper.java.additional.<n>=-Danypoint.platform.client_id=<PasteYourUniqueValueHere>",
         "point4": "<strong>Installing licesnse for gateway</strong>: <mule_home>/bin -> gateway -installLicense license.lic",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       },
       {
         "id":108,
         "title": "achieve highavailability in RTF",
         "content": "Configure with atleast two replicas, this ensures if one instance fails, other can continue",
         "point1": "Clustering and loadbalancing: ",
         "point2": "Monitoring and autoscaling: configure auto scaling polices in yaml file to automatically add or remove replicas based on demand.",
         "point3": "minReplicas:2, maxReplicas: 10, targetCPU UTlizationPercentage:80",
         "point4": "",
         "point5":"",
          "point6":"",
          "image": "<img src=\"\" style=\"width: 60%;\"> "
       }

       
       
 ]